Repository: oriveo/oriveo
Catalog: ios/Oriveo/Oriveo/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, id, ja, ko, pt_br, ru, th, tr, vi, zh_hans, zh_hant

# color_gray
source: Gray
ar: رمادي
de: Grau
es: Gris
fr: Gris
hi: रंग_ग्रे
id: warna_abu-abu
ja: グレー
ko: 회색
pt_br: Cinza
ru: цвет_серый
th: สี_สีเทา
tr: color_gray
vi: màu_xám
zh_hans: 灰色
zh_hant: 灰色

# color_green
source: Green
ar: أخضر
de: Grün
es: Verde
fr: Vert
hi: हरा रंग करें
id: warna_hijau
ja: グリーン
ko: 초록색
pt_br: Verde
ru: цвет_зеленый
th: สี_เขียว
tr: renk_yeşil
vi: màu_xanh
zh_hans: 绿色
zh_hant: 綠色

# color_indigo
source: Indigo
ar: نيلي
es: Índigo
hi: रंग_इंडिगो
id: warna_nila
ja: インディゴ
ko: 남색
pt_br: Índigo
ru: цвет_индиго
th: สีคราม
tr: color_indigo
vi: màu_màu chàm
zh_hans: 靛蓝
zh_hant: 靛藍

# color_orange
source: Orange
ar: برتقالي
es: Naranja
hi: रंग_नारंगी
id: warna_oranye
ja: オレンジ
ko: 주황색
pt_br: Laranja
ru: цвет_оранжевый
th: สี_สีส้ม
tr: renk_turuncu
vi: màu_cam
zh_hans: 橙色
zh_hant: 橙色

# color_pink
source: Pink
ar: وردي
de: Rosa
es: Rosa
fr: Rose
hi: रंग_गुलाबी
id: warna_merah muda
ja: ピンク
ko: 분홍색
pt_br: Rosa
ru: цвет_розовый
th: สี_ชมพู
tr: renkli_pembe
vi: màu_hồng
zh_hans: 粉色
zh_hant: 粉色

# color_purple
source: Purple
ar: بنفسجي
de: Lila
es: Púrpura
fr: Violet
hi: रंग_बैंगनी
id: warna_ungu
ja: パープル
ko: 보라색
pt_br: Roxo
ru: цвет_пурпурный
th: สี_สีม่วง
tr: color_purple
vi: màu_tím
zh_hans: 紫色
zh_hant: 紫色

# color_red
source: Red
ar: أحمر
de: Rot
es: Rojo
fr: Rouge
hi: रंग_लाल
id: warna_merah
ja: レッド
ko: 빨간색
pt_br: Vermelho
ru: цвет_красный
th: สี_แดง
tr: renk_kırmızı
vi: màu_đỏ
zh_hans: 红色
zh_hant: 紅色

# color_teal
source: Teal
ar: أزرق مخضر
de: Blaugrün
es: Verde azulado
fr: Sarcelle
hi: कलर टील
id: warna_teal
ja: ティール
ko: 청록색
pt_br: Azul-petróleo
ru: цвет_бирюзовый
th: สี_teal
tr: color_teal
vi: màu_teal
zh_hans: 青色
zh_hant: 青色

# color_yellow
source: Yellow
ar: أصفر
de: Gelb
es: Amarillo
fr: Jaune
hi: रंग_पीला
id: warna_kuning
ja: イエロー
ko: 노란색
pt_br: Amarelo
ru: цвет_желтый
th: สี_เหลือง
tr: color_yellow
vi: màu_vàng
zh_hans: 黄色
zh_hant: 黃色

source: e.g. 50.00
ar: مثال: 50.00
de: z.B. 50.00
es: ej. 50.00
fr: ex. 50.00
hi: जैसे 50.00
id: misalnya 50.00
ja: 例: 50.00
ko: 예: 50.00
pt_br: ex. 50.00
ru: например 50.00
th: เช่น 50.00 น
tr: örneğin 50.00
vi: ví dụ. 50,00
zh_hans: 例如 50.00
zh_hant: 例如 50.00

# file_extraction_action_switch_vision_model
source: Switch to a vision model
ar: التبديل إلى نموذج الرؤية
de: Zu einem Vision-Modell wechseln
es: Cambiar a modelo de visión
fr: Passer à un modèle de vision
hi: विज़न मॉडल पर स्विच करें
id: Beralih ke model vision
ja: ビジョンモデルに切り替える
ko: 비전 모델로 전환
pt_br: Mudar para um modelo de visão
ru: Переключиться на модель с поддержкой изображений
th: เปลี่ยนเป็นโมเดลวิชัน
tr: Görsel modele geç
vi: Chuyển sang mô hình nhận dạng hình ảnh
zh_hans: 切换到视觉模型
zh_hant: 切換到視覺模型

# file_extraction_chip_extracting
source: Extracting…
ar: جارٍ الاستخراج…
de: Wird extrahiert…
es: Extrayendo…
fr: Extraction en cours…
hi: निकाल रहे हैं…
id: Mengekstrak…
ja: 抽出中…
ko: 추출 중…
pt_br: Extraindo…
ru: Извлечение…
th: กำลังแยก…
tr: Çıkarılıyor…
vi: Đang trích xuất…
zh_hans: 提取中…
zh_hant: 提取中…

# file_extraction_chip_truncated
source: Truncated (%lld of %lld lines)
ar: مقتطع (%lld من %lld سطر)
de: Abgeschnitten (%lld von %lld Zeilen)
es: Truncado (%lld de %lld líneas)
fr: Tronqué (%lld sur %lld lignes)
hi: काटा गया (%lld/%lld पंक्तियाँ)
id: Dipotong (%lld dari %lld baris)
ja: 切り詰め（%lld 行中 %lld 行を表示）
ko: 잘림(%lld/%lld줄)
pt_br: Truncado (%lld de %lld linhas)
ru: Обрезано (%lld из %lld строк)
th: ถูกตัด (%lld จาก %lld บรรทัด)
tr: Kesildi (%lld/%lld satır)
vi: Bị cắt bớt (%lld/%lld dòng)
zh_hans: 已截断（共 %lld 行，已显示 %lld 行）
zh_hant: 已截斷（共 %lld 行，已顯示 %lld 行）

# file_extraction_error_corrupted
source: Couldn't read %@ — the file may be corrupted.
ar: تعذّر قراءة %@ — قد يكون الملف تالفاً.
de: %@ konnte nicht gelesen werden – die Datei ist möglicherweise beschädigt.
es: No se pudo leer %@ — el archivo puede estar dañado.
fr: Impossible de lire %@ — le fichier est peut-être corrompu.
hi: %@ पढ़ना संभव नहीं हुआ — फ़ाइल दूषित हो सकती है।
id: Tidak dapat membaca %@ — file mungkin rusak.
ja: %@ を読み込めませんでした — ファイルが破損している可能性があります。
ko: %@을(를) 읽을 수 없습니다 — 파일이 손상되었을 수 있습니다.
pt_br: Não foi possível ler %@ — o arquivo pode estar corrompido.
ru: Не удалось прочитать %@ — файл, возможно, повреждён.
th: ไม่สามารถอ่าน %@ ได้ — ไฟล์อาจเสียหาย
tr: %@ okunamadı — dosya bozulmuş olabilir.
vi: Không thể đọc %@ — tệp có thể bị hỏng.
zh_hans: 无法读取 %@——文件可能已损坏。
zh_hant: 無法讀取 %@——檔案可能已損壞。

# file_extraction_error_encrypted_pdf
source: %@ is password-protected. Decrypt the PDF first.
ar: %@ محمي بكلمة مرور. يرجى فك تشفير ملف PDF أولاً.
de: %@ ist passwortgeschützt. Entschlüsseln Sie zuerst das PDF.
es: %@ está protegido con contraseña. Descifra el PDF primero.
fr: %@ est protégé par un mot de passe. Décryptez d’abord le PDF.
hi: %@ पासवर्ड-सुरक्षित है। पहले PDF को डिक्रिप्ट करें।
id: %@ dilindungi kata sandi. Dekripsi PDF terlebih dahulu.
ja: %@ はパスワードで保護されています。先にPDFを復号してください。
ko: %@은(는) 암호로 보호되어 있습니다. 먼저 PDF의 암호를 해제하세요.
pt_br: %@ está protegido por senha. Descriptografe o PDF primeiro.
ru: %@ защищён паролем. Сначала расшифруйте PDF.
th: %@ ได้รับการป้องกันด้วยรหัสผ่าน กรุณาถอดรหัส PDF ก่อน
tr: %@ şifre korumalı. Önce PDF şifresini çözün.
vi: %@ được bảo vệ bằng mật khẩu. Hãy giải mã PDF trước.
zh_hans: %@ 已加密，请先解密 PDF。
zh_hant: %@ 已加密，請先解密 PDF。

# file_extraction_error_scanned_pdf
source: Couldn't extract text from %@ (looks like a scanned PDF).
ar: تعذّر استخراج النص من %@ (يبدو أنه ملف PDF ممسوح ضوئياً).
de: Text aus %@ konnte nicht extrahiert werden (sieht wie ein gescanntes PDF aus).
es: No se pudo extraer texto de %@ (parece un PDF escaneado).
fr: Impossible d’extraire le texte de %@ (semble être un PDF scanné).
hi: %@ से टेक्स्ट निकालना संभव नहीं हुआ (यह स्कैन किया गया PDF लगता है)।
id: Tidak dapat mengekstrak teks dari %@ (tampaknya PDF hasil scan).
ja: %@ からテキストを抽出できませんでした（スキャンした PDF のようです）。
ko: %@에서 텍스트를 추출할 수 없습니다(스캔된 PDF인 것 같습니다).
pt_br: Não foi possível extrair texto de %@ (parece um PDF digitalizado).
ru: Не удалось извлечь текст из %@ (похоже, это отсканированный PDF).
th: ไม่สามารถแยกข้อความจาก %@ ได้ (ดูเหมือน PDF ที่สแกน)
tr: %@ dosyasından metin çıkarılamadı (taranmış PDF gibi görünüyor).
vi: Không thể trích xuất văn bản từ %@ (có vẻ là PDF được quét).
zh_hans: 无法从 %@ 中提取文字（看起来是扫描版 PDF）。
zh_hant: 無法從 %@ 中提取文字（看起來是掃描版 PDF）。

# file_extraction_error_too_large
source: %@ is too large (max 50 MB).
ar: %@ كبير جداً (الحد الأقصى 50 ميغابايت).
de: %@ ist zu groß (max. 50 MB).
es: %@ es demasiado grande (máx. 50 MB).
fr: %@ est trop volumineux (max. 50 Mo).
hi: %@ बहुत बड़ा है (अधिकतम 50 MB)।
id: %@ terlalu besar (maks. 50 MB).
ja: %@ のサイズが大きすぎます（最大 50 MB）。
ko: %@이(가) 너무 큽니다(최대 50MB).
pt_br: %@ é muito grande (máx. 50 MB).
ru: %@ слишком большой (максимум 50 МБ).
th: %@ มีขนาดใหญ่เกินไป (สูงสุด 50 MB)
tr: %@ çok büyük (maks. 50 MB).
vi: %@ quá lớn (tối đa 50 MB).
zh_hans: %@ 太大了（最大 50 MB）。
zh_hant: %@ 太大了（最大 50 MB）。

# file_extraction_error_unsupported
source: %@ is not a supported file type.
ar: %@ ليس نوع ملف مدعوماً.
de: %@ ist kein unterstützter Dateityp.
es: %@ no es un tipo de archivo compatible.
fr: %@ n’est pas un type de fichier pris en charge.
hi: %@ एक समर्थित फ़ाइल प्रकार नहीं है।
id: %@ bukan tipe file yang didukung.
ja: %@ はサポートされていないファイル形式です。
ko: %@은(는) 지원되지 않는 파일 형식입니다.
pt_br: %@ não é um tipo de arquivo suportado.
ru: %@ — неподдерживаемый тип файла.
th: %@ ไม่ใช่ประเภทไฟล์ที่รองรับ
tr: %@ desteklenen bir dosya türü değil.
vi: %@ không phải là loại tệp được hỗ trợ.
zh_hans: %@ 不是受支持的文件类型。
zh_hant: %@ 不是支援的檔案類型。

# file_extraction_supported_formats_help
source: Supported: text, code, PDF, Office, EPUB, HTML, RTF, ODF
ar: المدعوم: نصوص، كود، PDF، Office، EPUB، HTML، RTF، ODF
de: Unterstützt: Text, Code, PDF, Office, EPUB, HTML, RTF, ODF
es: Compatible: texto, código, PDF, Office, EPUB, HTML, RTF, ODF
fr: Pris en charge : texte, code, PDF, Office, EPUB, HTML, RTF, ODF
hi: समर्थित: टेक्स्ट, कोड, PDF, Office, EPUB, HTML, RTF, ODF
id: Didukung: teks, kode, PDF, Office, EPUB, HTML, RTF, ODF
ja: サポート形式：テキスト、コード、PDF、Office、EPUB、HTML、RTF、ODF
ko: 지원: 텍스트, 코드, PDF, Office, EPUB, HTML, RTF, ODF
pt_br: Suportado: texto, código, PDF, Office, EPUB, HTML, RTF, ODF
ru: Поддерживается: текст, код, PDF, Office, EPUB, HTML, RTF, ODF
th: รองรับ: ข้อความ, โค้ด, PDF, Office, EPUB, HTML, RTF, ODF
tr: Desteklenen: metin, kod, PDF, Office, EPUB, HTML, RTF, ODF
vi: Hỗ trợ: văn bản, code, PDF, Office, EPUB, HTML, RTF, ODF
zh_hans: 支持：文本、代码、PDF、Office、EPUB、HTML、RTF、ODF
zh_hant: 支援：文字、程式碼、PDF、Office、EPUB、HTML、RTF、ODF

# file_extraction_total_skipped
source: Some attachments skipped: total size cap reached
ar: تم تخطي بعض المرفقات: تم بلوغ الحد الأقصى للحجم الإجمالي
de: Einige Anhänge übersprungen: Gesamtgröße erreicht
es: Algunos archivos adjuntos omitidos: límite de tamaño total alcanzado
fr: Certaines pièces jointes ignorées : limite de taille totale atteinte
hi: कुछ अनुलग्नक छोड़े गए: कुल आकार सीमा पूरी हो गई
id: Beberapa lampiran dilewati: batas ukuran total tercapai
ja: 一部の添付ファイルをスキップしました：合計サイズ上限に達しました
ko: 일부 첨부 파일 건너뜀: 총 용량 한도 도달
pt_br: Alguns anexos pulados: limite total de tamanho atingido
ru: Некоторые вложения пропущены: достигнут общий лимит размера
th: ข้ามไฟล์แนบบางส่วน: ถึงขีดจำกัดขนาดรวมแล้ว
tr: Bazı ekler atlandı: toplam boyut sınırına ulaşıldı
vi: Một số tệp đính kèm bỏ qua: đã đạt giới hạn tổng kích thước
zh_hans: 部分附件已跳过：已达总量上限
zh_hant: 部分附件已跳過：已達總量上限

# knowledge_cleanup_failed
source: Failed to clean up the remote Knowledge Base file. Try again later.
ar: فشل في تنظيف الملف البعيد. حاول مرة أخرى لاحقًا.
de: Die Remote-Datei konnte nicht bereinigt werden. Versuchen Sie es später noch einmal.
es: No se pudo limpiar el archivo remoto. Vuelve a intentarlo más tarde.
fr: Échec du nettoyage du fichier distant. Réessayez plus tard.
hi: रिमोट नॉलेज बेस फ़ाइल साफ़ नहीं हो सकी। बाद में फिर कोशिश करें।
id: Gagal membersihkan berkas Basis Pengetahuan jarak jauh. Coba lagi nanti.
ja: リモートファイルのクリーンアップに失敗しました。後でもう一度試してください。
ko: 원격 파일을 정리하지 못했습니다. 나중에 다시 시도하세요.
pt_br: Falha ao limpar o arquivo remoto. Tente novamente mais tarde.
ru: Не удалось удалить удалённый файл базы знаний. Повторите попытку позже.
th: ล้างไฟล์ฐานความรู้ระยะไกลไม่สำเร็จ โปรดลองอีกครั้งภายหลัง
tr: Uzak Bilgi Bankası dosyası temizlenemedi. Daha sonra tekrar deneyin.
vi: Không thể dọn dẹp tệp Cơ sở tri thức từ xa. Vui lòng thử lại sau.
zh_hans: 远端知识库文件清理失败，请稍后重试。
zh_hant: 遠端知識庫檔案清理失敗，請稍後再試。

# knowledge_extract_failed
source: Failed to extract text from this file.
ar: فشل استخراج النص من هذا الملف.
de: Text konnte aus dieser Datei nicht extrahiert werden.
es: No se pudo extraer el texto de este archivo.
fr: Échec de l'extraction du texte de ce fichier.
hi: इस फ़ाइल से टेक्स्ट नहीं निकाला जा सका।
id: Gagal mengekstrak teks dari berkas ini.
ja: このファイルからテキストを抽出できませんでした。
ko: 이 파일에서 텍스트를 추출하지 못했습니다.
pt_br: Falha ao extrair texto deste arquivo.
ru: Не удалось извлечь текст из этого файла.
th: ไม่สามารถดึงข้อความจากไฟล์นี้ได้
tr: Bu dosyadan metin çıkarılamadı.
vi: Không thể trích xuất văn bản từ tệp này.
zh_hans: 提取这个文件的文字内容失败。
zh_hant: 擷取這個檔案的文字內容失敗。

# knowledge_file_too_large
source: Knowledge Base files must be 20 MB or smaller.
ar: يجب أن يكون حجم ملفات قاعدة المعارف 20 ميغابايت أو أصغر.
de: Wissensdatenbankdateien dürfen maximal 20 MB groß sein.
es: Los archivos de la base de conocimientos deben tener 20 MB o menos.
fr: Les fichiers de la base de connaissances doivent faire 20 Mo ou moins.
hi: नॉलेज बेस फ़ाइलें 20 MB या उससे छोटी होनी चाहिए।
id: Berkas Basis Pengetahuan harus berukuran 20 MB atau lebih kecil.
ja: ナレッジベース ファイルは 20 MB 以下である必要があります。
ko: 기술 자료 파일은 20MB 이하여야 합니다.
pt_br: Os arquivos da Base de Conhecimento devem ter 20 MB ou menos.
ru: Файлы базы знаний должны быть не больше 20 МБ.
th: ไฟล์ฐานความรู้ต้องมีขนาดไม่เกิน 20 MB
tr: Bilgi Bankası dosyaları en fazla 20 MB olmalıdır.
vi: Tệp Cơ sở tri thức phải có dung lượng 20 MB trở xuống.
zh_hans: 知识库文件必须小于等于 20 MB。
zh_hant: 知識庫檔案必須小於等於 20 MB。

# knowledge_index_failed
source: Failed to index this Knowledge Base file.
ar: فشل في فهرسة هذا الملف.
de: Diese Datei konnte nicht indiziert werden.
es: No se pudo indexar este archivo.
fr: Échec de l'indexation de ce fichier.
hi: इस नॉलेज बेस फ़ाइल को इंडेक्स नहीं किया जा सका।
id: Gagal mengindeks berkas Basis Pengetahuan ini.
ja: このファイルのインデックス作成に失敗しました。
ko: 이 파일을 색인화하지 못했습니다.
pt_br: Falha ao indexar este arquivo.
ru: Не удалось проиндексировать этот файл базы знаний.
th: ไม่สามารถจัดทำดัชนีไฟล์ฐานความรู้นี้ได้
tr: Bu Bilgi Bankası dosyası dizine eklenemedi.
vi: Không thể lập chỉ mục tệp Cơ sở tri thức này.
zh_hans: 为这个知识库文件建立索引失败。
zh_hant: 為這個知識庫檔案建立索引失敗。

# knowledge_retrieve_failed
source: Knowledge retrieval failed for this message.
ar: فشل استرداد المعرفة لهذه الرسالة.
de: Der Wissensabruf für diese Nachricht ist fehlgeschlagen.
es: La recuperación de conocimientos falló para este mensaje.
fr: La récupération des connaissances a échoué pour ce message.
hi: इस संदेश के लिए नॉलेज पुनर्प्राप्ति विफल रही।
id: Pengambilan pengetahuan gagal untuk pesan ini.
ja: このメッセージのナレッジの取得は失敗しました。
ko: 이 메시지에 대한 지식 검색에 실패했습니다.
pt_br: A recuperação de conhecimento falhou para esta mensagem.
ru: Не удалось получить знания для этого сообщения.
th: การดึงข้อมูลความรู้สำหรับข้อความนี้ล้มเหลว
tr: Bu mesaj için bilgi getirme başarısız oldu.
vi: Truy xuất tri thức cho tin nhắn này không thành công.
zh_hans: 这条消息的知识库检索失败。
zh_hant: 這則訊息的知識庫檢索失敗。

# knowledge_service_unavailable
source: Knowledge Base is unavailable right now.
ar: قاعدة المعرفة غير متاحة مؤقتًا. لا يزال بإمكانك تعديل هذه المهارة وحفظها.
de: Die Wissensdatenbank ist vorübergehend nicht verfügbar. Sie können diesen Skill weiterhin bearbeiten und speichern.
es: La base de conocimientos no está disponible temporalmente. Aún puedes editar y guardar esta habilidad.
fr: La base de connaissances est temporairement indisponible. Vous pouvez toujours modifier et enregistrer cette compétence.
hi: नॉलेज बेस अभी उपलब्ध नहीं है।
id: Basis Pengetahuan sedang tidak tersedia.
ja: ナレッジベースは一時的に利用できなくなります。このスキルは引き続き編集して保存できます。
ko: 기술 자료를 일시적으로 사용할 수 없습니다. 이 스킬을 계속 편집하고 저장할 수 있습니다.
pt_br: A Base de Conhecimento está temporariamente indisponível. Você ainda pode editar e salvar esta habilidade.
ru: База знаний сейчас недоступна.
th: ฐานความรู้ไม่พร้อมใช้งานในขณะนี้
tr: Bilgi Bankası şu anda kullanılamıyor.
vi: Cơ sở tri thức hiện không khả dụng.
zh_hans: Skill 知识库暂时不可用，你仍可继续编辑并保存这个 Skill。
zh_hant: Skill 知識庫暫時不可用，你仍可繼續編輯並儲存這個 Skill。

# knowledge_total_size_exceeded
source: A Skill can have up to 5 Knowledge Base files and 100 MB total.
ar: يمكن أن تحتوي المهارة على ما يصل إلى 5 ملفات قاعدة معارف ويبلغ إجمالي حجمها 100 ميجابايت.
de: Ein Skill kann bis zu 5 Wissensdatenbankdateien und insgesamt 100 MB haben.
es: Una habilidad puede tener hasta 5 archivos de base de conocimientos y 100 MB en total.
fr: Une compétence peut contenir jusqu'à 5 fichiers de base de connaissances et 100 Mo au total.
hi: एक Skill में अधिकतम 5 नॉलेज बेस फ़ाइलें और कुल 100 MB हो सकते हैं।
id: Satu Skill dapat memiliki hingga 5 berkas Basis Pengetahuan dan total 100 MB.
ja: スキルには最大 5 つのナレッジ ベース ファイル、合計 100 MB を含めることができます。
ko: 스킬에는 최대 5개의 기술 자료 파일과 총 100MB가 포함될 수 있습니다.
pt_br: Uma Skill pode ter até 5 arquivos da Base de Conhecimento e 100 MB no total.
ru: В одном Skill может быть до 5 файлов базы знаний общим объёмом до 100 МБ.
th: หนึ่ง Skill มีไฟล์ฐานความรู้ได้สูงสุด 5 ไฟล์ และรวมกันไม่เกิน 100 MB
tr: Bir Skill en fazla 5 Bilgi Bankası dosyası ve toplam 100 MB içerebilir.
vi: Mỗi Skill có thể có tối đa 5 tệp Cơ sở tri thức và tổng cộng 100 MB.
zh_hans: 单个 Skill 最多 5 个知识库文件，且总大小不能超过 100 MB。
zh_hant: 單個 Skill 最多 5 個知識庫檔案，且總大小不能超過 100 MB。

# knowledge_upload_failed
source: Failed to upload this Knowledge Base file.
ar: فشل تحميل هذا الملف.
de: Diese Datei konnte nicht hochgeladen werden.
es: No se pudo cargar este archivo.
fr: Échec du téléchargement de ce fichier.
hi: इस नॉलेज बेस फ़ाइल को अपलोड नहीं किया जा सका।
id: Gagal mengunggah berkas Basis Pengetahuan ini.
ja: このファイルのアップロードに失敗しました。
ko: 이 파일을 업로드하지 못했습니다.
pt_br: Falha ao carregar este arquivo.
ru: Не удалось загрузить этот файл базы знаний.
th: ไม่สามารถอัปโหลดไฟล์ฐานความรู้นี้ได้
tr: Bu Bilgi Bankası dosyası yüklenemedi.
vi: Không thể tải lên tệp Cơ sở tri thức này.
zh_hans: 上传这个知识库文件失败。
zh_hant: 上傳這個知識庫檔案失敗。

source: of %@
ar: من%@
de: von%@
es: de%@
fr: de%@
hi: %@का
id: dari%@
ja: %@の
ko: %@중
pt_br: de%@
ru: из%@
th: ของ%@
vi: của%@

# openai_endpoint_not_official
source: Knowledge Base requires the official OpenAI endpoint.
ar: تعمل قاعدة المعرفة فقط مع نقطة نهاية OpenAI الرسمية.
de: Die Wissensdatenbank funktioniert nur mit dem offiziellen OpenAI-Endpunkt.
es: La base de conocimientos solo funciona con el punto final oficial de OpenAI.
fr: La base de connaissances ne fonctionne qu'avec le point de terminaison officiel OpenAI.
hi: नॉलेज बेस के लिए आधिकारिक OpenAI एंडपॉइंट आवश्यक है।
id: Basis Pengetahuan memerlukan endpoint OpenAI resmi.
ja: ナレッジベースは、公式の OpenAI エンドポイントでのみ動作します。
ko: 기술 자료는 공식 OpenAI 엔드포인트에서만 작동합니다.
pt_br: A Base de Conhecimento funciona apenas com o endpoint oficial do OpenAI.
ru: Для базы знаний требуется официальная конечная точка OpenAI.
th: ฐานความรู้ต้องใช้เอนด์พอยต์ OpenAI อย่างเป็นทางการ
tr: Bilgi Bankası resmi OpenAI uç noktasını gerektirir.
vi: Cơ sở tri thức yêu cầu endpoint OpenAI chính thức.
zh_hans: Skill 知识库仅支持官方 OpenAI endpoint。
zh_hant: Skill 知識庫僅支援官方 OpenAI endpoint。

source: packy / ylsagi / code-for / cc-switch family
ar: عائلة packy / ylsagi / code-for / cc-switch
de: Familie packy / ylsagi / code-for / cc-switch
es: Familia packy / ylsagi / code-for / cc-switch
fr: Famille packy / ylsagi / code-for / cc-switch
hi: packy / ylsagi / code-for / cc-switch परिवार
id: Keluarga packy / ylsagi / code-for / cc-switch
ja: packy / ylsagi / code-for / cc-switch 系列
ko: packy / ylsagi / code-for / cc-switch 계열
pt_br: família packy / ylsagi / code-for / cc-switch
ru: Семейство packy / ylsagi / code-for / cc-switch
th: ตระกูล packy / ylsagi / code-for / cc-switch
tr: packy / ylsagi / code-for / cc-switch ailesi
vi: Họ packy / ylsagi / code-for / cc-switch
zh_hans: packy / ylsagi / code-for / cc-switch 系列
zh_hant: packy / ylsagi / code-for / cc-switch 系列

# reference_file_too_large
source: Reference files must be 3 MB or smaller.
ar: يجب أن يكون حجم الملفات المرجعية 3 ميغابايت أو أصغر.
de: Referenzdateien dürfen maximal 3 MB groß sein.
es: Los archivos de referencia deben tener un tamaño de 3 MB o menos.
fr: Les fichiers de référence doivent faire 3 Mo ou moins.
hi: संदर्भ फ़ाइलें 3 MB या उससे छोटी होनी चाहिए।
id: Berkas referensi harus berukuran 3 MB atau lebih kecil.
ja: 参照ファイルは 3 MB 以下である必要があります。
ko: 참조 파일은 3MB 이하여야 합니다.
pt_br: Os arquivos de referência devem ter 3 MB ou menos.
ru: Справочные файлы должны быть не больше 3 МБ.
th: ไฟล์อ้างอิงต้องมีขนาดไม่เกิน 3 MB
tr: Referans dosyaları en fazla 3 MB olmalıdır.
vi: Tệp tham chiếu phải có dung lượng 3 MB trở xuống.
zh_hans: 参考文件必须小于等于 3 MB。
zh_hant: 參考檔案必須小於等於 3 MB。

# retrieval_model_not_enabled
source: Add and enable the required model in your OpenAI provider first.
ar: قم بإضافة وتمكين {model} في موفر OpenAI الخاص بك أولاً.
de: Fügen Sie zuerst {model} in Ihrem OpenAI-Anbieter hinzu und aktivieren Sie es.
es: Primero agregue y habilite {model} en su proveedor de OpenAI.
fr: Ajoutez et activez d'abord {model} dans votre fournisseur OpenAI.
hi: पहले अपने OpenAI provider में आवश्यक मॉडल जोड़ें और सक्षम करें।
id: Tambahkan dan aktifkan model yang diperlukan di provider OpenAI Anda terlebih dahulu.
ja: まず、OpenAI プロバイダーに {model} を追加して有効にします。
ko: 먼저 OpenAI 공급자에 {model}을 추가하고 활성화하세요.
pt_br: Adicione e habilite {model} em seu provedor OpenAI primeiro.
ru: Сначала добавьте и включите нужную модель в вашем провайдере OpenAI.
th: โปรดเพิ่มและเปิดใช้งานโมเดลที่จำเป็นในผู้ให้บริการ OpenAI ของคุณก่อน
tr: Önce OpenAI sağlayıcınıza gerekli modeli ekleyip etkinleştirin.
vi: Trước tiên, hãy thêm và bật mô hình cần thiết trong provider OpenAI của bạn.
zh_hans: 请先在 OpenAI provider 中添加并启用 {model}。
zh_hant: 請先在 OpenAI provider 中新增並啟用 {model}。

# skill.blog_writer.description
source: Engaging long-form content and blog posts
ar: محتوى طويل جذاب ومقالات مدونات
de: Ansprechende Langform-Inhalte und Blog-Beiträge
es: Contenido extenso atractivo y publicaciones de blog
fr: Contenu long-format engageant et articles de blog
hi: कौशल.ब्लॉग_लेखक.विवरण
id: skill.blog_writer.deskripsi
ja: 魅力的な長文コンテンツとブログ記事
ko: 매력적인 장문 콘텐츠 및 블로그 게시물
pt_br: Conteúdo longo envolvente e posts de blog
ru: навык.blog_writer.description
th: Skill.blog_writer.description
tr: skill.blog_writer.description
vi: Skill.blog_writer.description
zh_hans: 引人入胜的长文内容和博客文章
zh_hant: 引人入勝的長文內容和部落格文章

# skill.blog_writer.name
source: Blog Writer
ar: كاتب مدونات
de: Blog-Autor
es: Escritor de blog
fr: Rédacteur de blog
hi: कौशल.ब्लॉग_लेखक.नाम
id: skill.blog_writer.nama
ja: ブログライター
ko: 블로그 라이터
pt_br: Escritor de blog
ru: навык.blog_writer.name
th: ทักษะ.blog_writer.name
tr: beceri.blog_writer.name
vi: kỹ năng.blog_writer.name
zh_hans: 博客写手
zh_hant: 部落格寫手

# skill.blog_writer.starter_0
source: Write a blog post about...
ar: اكتب مقالة مدونة عن...
de: Schreib einen Blogbeitrag über…
es: Escribe un post de blog sobre...
fr: Écris un article de blog sur…
hi: कौशल.ब्लॉग_लेखक.स्टार्टर_0
id: skill.blog_writer.starter_0
ja: ……についてブログ記事を書いて
ko: 이 주제로 블로그 글을 작성해 주세요...
pt_br: Escreva um post de blog sobre...
ru: навык.blog_writer.starter_0
th: ทักษะ.blog_writer.starter_0
tr: beceri.blog_writer.starter_0
vi: kỹ năng.blog_writer.starter_0
zh_hans: 写一篇关于……的博客
zh_hant: 寫一篇關於……的部落格

# skill.blog_writer.starter_1
source: Create an outline for an article on...
ar: أنشئ مخططاً لمقال عن...
de: Erstelle eine Gliederung für einen Artikel über…
es: Crea un esquema para un artículo sobre...
fr: Crée un plan pour un article sur…
hi: कौशल.ब्लॉग_लेखक.स्टार्टर_1
id: skill.blog_writer.starter_1
ja: ……に関する記事のアウトラインを作成して
ko: 이 주제의 글 개요를 만들어 주세요...
pt_br: Crie um outline para um artigo sobre...
ru: навык.blog_writer.starter_1
th: ทักษะ.blog_writer.starter_1
tr: beceri.blog_writer.starter_1
vi: kỹ năng.blog_writer.starter_1
zh_hans: 为一篇关于……的文章拟大纲
zh_hant: 為一篇關於……的文章擬大綱

# skill.blog_writer.starter_2
source: Improve this draft's structure
ar: حسّن بنية هذه المسودة
de: Verbessere die Struktur dieses Entwurfs
es: Mejora la estructura de este borrador
fr: Améliore la structure de ce brouillon
hi: कौशल.ब्लॉग_लेखक.स्टार्टर_2
id: skill.blog_writer.starter_2
ja: この下書きの構成を改善して
ko: 이 초안의 구조를 개선해 주세요
pt_br: Melhore a estrutura deste rascunho
ru: навык.blog_writer.starter_2
th: ทักษะ.blog_writer.starter_2
tr: beceri.blog_writer.starter_2
vi: kỹ năng.blog_writer.starter_2
zh_hans: 改进这篇草稿的结构
zh_hant: 改善這篇草稿的結構

# skill.blog_writer.starter_3
source: Suggest blog topic ideas for...
ar: اقترح أفكار مواضيع للمدونة عن...
de: Schlage Blog-Themen vor für…
es: Sugiere ideas de temas para el blog de...
fr: Propose des idées de sujets de blog pour…
hi: कौशल.ब्लॉग_लेखक.स्टार्टर_3
id: skill.blog_writer.starter_3
ja: ……のブログネタを提案して
ko: 이 주제에 맞는 블로그 아이디어를 제안해 주세요...
pt_br: Sugira ideias de temas de blog para...
ru: навык.blog_writer.starter_3
th: ทักษะ.blog_writer.starter_3
tr: beceri.blog_writer.starter_3
vi: kỹ năng.blog_writer.starter_3
zh_hans: 为……推荐博客选题
zh_hant: 為……推薦部落格選題

# skill.brainstorm.description
source: Generate ideas and explore possibilities
ar: توليد الأفكار واستكشاف الاحتمالات
de: Ideen generieren und Möglichkeiten erkunden
es: Generar ideas y explorar posibilidades
fr: Générer des idées et explorer les possibilités
hi: कौशल.मंथन.विवरण
id: keterampilan.brainstorm.deskripsi
ja: アイデア創出と可能性の探索
ko: 아이디어 생성 및 가능성 탐색
pt_br: Gerar ideias e explorar possibilidades
ru: навык.brainstorm.description
th: ทักษะการระดมสมองคำอธิบาย
tr: beceri.beyin fırtınası.açıklama
vi: kỹ năng.brainstorm.description
zh_hans: 产生创意和探索可能性
zh_hant: 產生創意和探索可能性
